psuiappserver/DJLIRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header/><SOAP-ENV:Body><nmwg:message xmlns="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:hades="http://ggf.org/ns/nmwg/tools/hades/" xmlns:nmtm="http://ggf.org/ns/nmwg/time/2.0/" xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/" xmlns:nmwgt="http://ggf.org/ns/nmwg/topology/2.0/" xmlns:perfsonar="http://ggf.org/ns/nmwg/tools/org/perfsonar/1.0/" xmlns:select="http://ggf.org/ns/nmwg/ops/select/" type="SetupDataRequest"><nmwg:metadata id="metadata1"><hades:subject id="subject1"/><nmwg:eventType>http://ggf.org/ns/nmwg/tools/hades/</nmwg:eventType><hades:parameters id="param1"><nmwg:parameter name="precedence" value="0x0"/><nmwg:parameter name="groupsize" value="9"/><nmwg:parameter name="interval" value="60"/><nmwg:parameter name="packetsize" value="41"/></hades:parameters></nmwg:metadata><nmwg:metadata id="metadata1-2"><select:subject id="subject1-2" metadataIdRef="metadata1"/><nmwg:eventType>http://ggf.org/ns/nmwg/ops/select/2.0</nmwg:eventType><select:parameters id="param1-2"><nmwg:parameter name="startTime">1403989242</nmwg:parameter><nmwg:parameter name="endTime">1404075642</nmwg:parameter></select:parameters></nmwg:metadata><nmwg:data id="data1" metadataIdRef="metadata1-2"/></nmwg:message></SOAP-ENV:Body></SOAP-ENV:Envelope>